app/controllers/web_pages_controller.rb

SELECT "web_pages".* FROM "web_pages"
---
  def index
    @web_pages = WebPage.all

INSERT INTO "web_pages" ("company_name", "url", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @web_page = WebPage.new(web_page_params)

    respond_to do |format|
      if @web_page.save

UPDATE "web_pages" SET "content" = ?, "updated_at" = ? WHERE "web_pages"."id" = ?
---
  def update
    respond_to do |format|
      if @web_page.update(web_page_params)

SELECT  "web_pages".* FROM "web_pages" WHERE "web_pages"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_web_page
      @web_page = WebPage.find(params[:id])