app/controllers/web_data_controller.rb

SELECT "web_data".* FROM "web_data"
---
  def index
    @web_data = WebData.all